package com.dzianis.patterns.GRASP.InformationExpert;

/**
 * Шаблон информационный эксперт (Information Expert)- GRASP 
 * 
 * Проблема 
 * В системе должна аккумулироваться, рассчитываться и т. п. необходимая информация. 
 * 
 * Решение  
 * Назначить обязанность аккумуляции информации, расчета и т. п. некоему классу (информационному эксперту), 
 * обладающему необходимой информацией. (Информация должна обрабатываться там где она есть!)
 * 
 * Рекомендации  
 * Информационным экспертом может быть не один класс, а несколько.
 *
 */
public class Demo {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
