package com.dzianis.patterns.GRASP.Indirection;

/**
 * Перенаправление (Indirection) - GRASP 
 * 
 * Проблема 
 * Как перераспределить обязанности обьектов, чтобы обеспечить отсутствие прямого связывания? 
 * 
 * Решение 
 * Присвоить обязанности по обеспечению связи между службами или компонентами промежуточному объекту. 
 * Пример См. пример к паттерну "Искусственный". 
 * Класс "Хранилище" выступает в роли промежуточного звена между классом "Продажа" и базой данных.
 * 
 * Принцип инверсии зависимостей (The Dependency Inversion Principle
 * «Зависимость на Абстракциях. Нет зависимости на что-то конкретное.»
 * 
 * См. также: Посредник (шаблон проектирования)
 * 
 */
public class Demo {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
