package com.dzianis.patterns.GRASP.PureFabrication;

/**
 * Искусственный (Pure Fabrication) - GRASP
 * 
 * Проблема 
 * Какой класс должен обеспечивать реализацию паттернов "Высокое зацепление", 
 * и "Низкая связанность"? 
 * 
 * Решение 
 * Присвоить группу обязанностей с высокой степенью зацепления классу, 
 * который не представляет конкретного понятия из предметной области 
 * (синтезировать искусственную сущность для обеспечения высокого зацепления и слабого связывания).
 * 
 */
public class Demo {

	public static void main(String[] args) {

	}

}
