package com.dzianis.patterns.GRASP.Polymorphism;

/**
 * Полиморфизм (Polymorphism) - GRASP 
 * 
 * Проблема 
 * Как обрабатывать альтернативные варианты поведения на основе типа? 
 * Как заменять подключаемые компоненты системы? 
 * 
 * Решение 
 * Обязанности распределяются для различных вариантов поведения 
 * с помощью полиморфных операций для этого класса. 
 * Каждая внешняя система имеет свой интерфейс.
 * 
 *
 */
public class Demo {

	public static void main(String[] args) {

	}
}
